{
	"order": [ "origin", "origin", "goal", "goal", "obstacle", "obstacle", "reward", "reward" ],
	"cat": {
		"origin": {
			"a": "I was born like really far away, farther than the distance bewteen my emotions and your emotions.",
			"b": "My home was the meeting point of many aimless winds.",
			"c": "Where I grew up nothing happened.  I only dreamed of parties and creatures so unlike me." },
		"goal": {
			"a": "The party was fun.  I liked the television.",
			"b": "It seems like there's a contest to be the most lonely creature in idtio.",
			"c": "The mirror world that everyone talks about, is it the same as idtio, but like more chill?" },
		"obstacle": {
			"a": "I heard that the smell is really fowl, like the farting trees in the east but even worse.",
			"b": "When all the creatures are together I always get in trouble for talking to someone and not someone else.",
			"c": "If we were friends for one thousandth of one second or a thousand years, what's the difference?" },
		"reward": {
			"a": "If I have to look for something, I guess I'd like to find myself.",
			"b": "The pig keeps talking about this land under idtio that's like the veins under our skin, its so gross.",
			"c": "The birds say the meaning of life or whatever is in the bowels of the earth.  I don't know if it's supposed to be funny." },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ab" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"pig": {
		"origin": {
			"a": "In my home land, a boring, neglected place, the earth is dry and the sea is acidic.",
			"b": "As an child I swam in the yellow waters of the south, and I dreamed to swim around the world to the north but I don't know if it works like that.",
			"c": "I came from a big litter of pigs and I was the biggest of all." },
		"goal": {
			"a": "I have suffered long searching for beauty, beauty in both creatures and thoughts, like thoughts about beauty.",
			"b": "To be honest, I often lay restless at night wondering what it is the cat and television discuss so frequently in hushed tones.",
			"c": "If a creature has a tale I will listen, and if they have ears I will tell my own." },
		"obstacle": {
			"a": "No one in this land can answer my most pressing concern, is it real, true love? Is true love real?",
			"b": "I have cried for days pondering the mystery of why no one remembers me.",
			"c": "Like love, I believe the void is a myth, reeking of falsehood." },
		"reward": {
			"a": "The most famous mystery of this land is the creature called cat, I would only go into the void if it would reveal the nature of the cat.",
			"b": "I haven't seen the fruit since the party.  Once we were great friends, but I fear, no longer.",
			"c": "Is it noble to be alone? Can one find love without first knowing isolation?" },
		"cat": { "origin": "abc", "goal": "c", "obstacle": "abc",  "reward": "bc" },
		"birds": { "origin": "abc", "goal": "c", "obstacle": "ab",  "reward": "c" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"birds": {
		"origin": {
			"a": "I grew up in the dense forest in the east.",
			"b": "I'm from the east, where trees begin and the desert ends.",
			"c": "I was happy living in the forest among the birds, I felt like I belonged." },
		"goal": {
			"a": "I left the forest, thinking I was in love, following a beautiful and filthy creature across the rock path and into the hills.",
			"b": "I heard myths of an emotion called love in the whirring sounds of the bugs in the trees.",
			"c": "One day I will build a nest." },
		"obstacle": {
			"a": "Do you know what love is?  Is it like the illuminating sunrise?  Is like the endless ocean?",
			"b": "It was like we were two boats at sea going toward each other before the cat just fell asleep and drifted away.",
			"c": "I could fly across the sea but there's something in my bowels, some nameless feeling, that holds me back." },
		"reward": {
			"a": "The void sounds like a lonely place to me.",
			"b": "What if I get to the void and there's no one else there? What if I can't leave?",
			"c": "In the forest they say the void is just a story, a denial of love, a refusal of discovery, a rejection of reciprocity." },
		"cat": { "origin": "abc", "goal": "ab", "obstacle": "ab", "reward": "ac" },
		"pig": { "origin": "abc", "goal": "bc", "obstacle": "ab", "reward": "c" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "ab" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"fruit": {
		"origin": {
			"a": "I was born in the south in the shadow of idtio's oldest tree.",
			"b": "In that curve of land the young become old.",
			"c": "My smelly home reeks of age and decay." },
		"goal": {
			"a": "The party was like a lot of staring, like thousands of eyes cast in shadow, their gaze covering any space where creatures might move.",
			"b": "The cat waits to be approached.  Some creatures find it mysterious.  Some creatures don't care.",
			"c": "The pig, he waved at me, like he was making nautical signs from a distant vessel, but from the same room, like, literally ten feet away." },
		"obstacle": {
			"a": "I feel I would be fine like not knowing where everyone is from and where they're going, every creature is from somewhere and we're all going nowhere.",
			"b": "I know we have to talk because there's nothing else to do but we could talk about the waves in the ocean, or the colors in the sunset or even the breeze that scatters leaves around the trees instead of some stupid smelly void the doesn't even exist.",
			"c": "Sorry I didn't see you waving." },
		"reward": {
			"a": "If the void is real the pig will find it and I'd rather continue wandering the desert than be stuck in made up mythical mirror world with that pig.",
			"b": "I'll wait here. I'll see you later.",
			"c": "It's a lie made up by a devious creature, and that's what I will continue to believe even if it's not true." },
		"cat": { "origin": "abc", "goal": "ac", "obstacle": "abc", "reward": "ab" },
		"pig": { "origin": "abc", "goal": "ab", "obstacle": "abc", "reward": "bc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"worm": {
		"origin": {
			"a": "I was born probably in some dark dirt.",
			"b": "I could have come from anywhere, I emerged from dirt and then I was blinded by the endless sun.",
			"c": "I had to study for years under the wisest of worms to escape the endless dirt." },
		"goal": {
			"a": "With my pen of darkest ink I captured that party of all varieties of creature, that wonderful achievement of camaraderie, on the most delicate of papers.",
			"b": "Through my lifetime of suffering in squalor I learned to appreciate the beauty of limbful creatures in their world.",
			"c": "My art is a record of all the many creatures I have seen in this land." },
		"obstacle": {
			"a": "And the creatures look down at me and I see them thinking, 'Oh you're a worm.'",
			"b": "I can see it in the eyes of my beloved, 'You're disgusting.'",
			"c": "My insides are visible through my translucent skin, it distracts the creatures of this world, the stare at me like a nauseating entertainment." },
		"reward": {
			"a": "I can enter the world below the surface, I can dig through graves and unearth secrets.",
			"b": "I've seen death, I've tasted it and painted it.",
			"c": "In the void I will paint the beautiful fruit, the only creature that could understand me, as my final portrait." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "ab" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"tv": {
		"origin": {
			"a": "I never left the house, until it burned down.",
			"b": "The house was good for parties, I didn't really know where everyone else went otherwise.",
			"c": "The house was burned down so I guess I'm not from anywhere anymore." },
		"goal": {
			"a": "Not long ago I was the source of light in darkness, where the creatures gathered to be together.",
			"b": "Everyone is searching for some mythic void, a portal, a inversion of light and dark, to fill the void of my burned down home, the home of parties.",
			"c": "I feel lonely outside in the changeless air, in search of some stinking hole, the true hole, not the hole of flowers or the hole of hearts, but the hole of skulls, the hole of death." },
		"obstacle": {
			"a": "How was I to know the pig was so obsessed with those creatures?  I wanted only to entertain my guests like a good host.",
			"b": "The era of hanging out with everyone has passed and so I pass my days walking back and forth across the stones dividing the land of idtio, waiting for them to give up searching for the endless darkness, the inverted light.",
			"c": "I can't forget the screams of the creatures I heard as the flames found their way upstairs, they echo in my empty head like bats in a cave." },
		"reward": {
			"a": "I want to be with the birds and their beautiful song, I could listen forever.",
			"b": "I want to be with the worm and watch the ink spread across each pleasing portrait.",
			"c": "I want to chill with the cat, the chillest creature who ever chilled." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ab" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "bc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "bc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"cactus": {
		"origin": {
			"a": "I'm from the deserted lands beyond the house and two hills.",
			"b": "I was a child poet, author of an endless verse, about the endlessness of the desert.",
			"c": "The endless heat of the son was my parent and the endless darkness of night was my other parent." },
		"goal": {
			"a": "I described the heat, the sun, the cold, the moon.",
			"b": "I will write a new verse in the inverted void.",
			"c": "In the myth there is a true void hidden in the shadows, while false voids pierce the appendages of our land." },
		"obstacle": {
			"a": "My poem is about everything that has ever been imagined, every creature who has ever lived, every possibility that could be introduced in the inverted world.",
			"b": "No creature could compare to my endless companion, my endless poem.",
			"c": "It's true that no one understands the point of writing a poem." },
		"reward": {
			"a": "Of the birds I would write a verse of aloofity, about waiting behind a wall of quiescence, waiting for any other creature to cross that turbulent river of desolation.",
			"b": "Of the pig a bombastic ballad, a rueful lyric, a stupid haiku, on a pig eating poop.",
			"c": "Of the cat a quatrain of sadness, subtract one line for the words never spoken, and another for the looks unreturned, so a couplet like the couplets refused with creatures far and wide and especially, fantasticly far." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "bc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"fish": {
		"origin": {
			"a": "I spawned in the North Sea ten years before the ten year party.",
			"b": "For years the other fish told me that no one would come to the sea so reluctantly I made my way to the land.",
			"c": "In childhood I was too busy swimming for my life to make friends." },
		"goal": {
			"a": "I only really hate one creature, a vile, slimy, legless worm.",
			"b": "I know that my time with the television was the most comfortable for me but I also know the television will never be happy with just the fish.",
			"c": "I don't want to talk about the party.  I'm over it.  We live in a vast land of mystery and sadness and that party ended ten years ago." },
		"obstacle": {
			"a": "My heart is pulled between sorrow and joy like the waves push and pull and break on the land.",
			"b": "Even if I wanted to I couldn't stop caring about the feelings of every creature.",
			"c": "If I wondered should I have ever left the sea wouldn't be able to go on." },
		"reward": {
			"a": "If they find death before the void these creatures will continue to wallow in their stupid sorrow, but they don't know death and the void are one and the same.",
			"b": "The land is so dry.  The sun is so hot.  Why doesn't anyone love me?",
			"c": "I know I can't find love in the sea. But where is the love on land?" },
		"cat": { "origin": "abc", "goal": "ab", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "ac", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"bug": {
		"origin": {
			"a": "I think I grew up in a pile of garbage for a while, I don't know where it was.  My parents didn't really talk about our family history.",
			"b": "I don't really remember anything that happened before yesterday, or today.",
			"c": "I remember the hunger of childhood like the hunger I feel now.  Have you eaten?" },
		"goal": {
			"a": "I've lived through worse than the party fire, and I keep on living for whatever reason.",
			"b": "Like the worm I've lived in dirt and worse, but I didn't become an annoying turd.",
			"c": "My memories rot like garbage in the sun, if I found the void I wouldn't even remember if I was in the void or outside of it." },
		"obstacle": {
			"a": "The legless fish sees the legless worm and thinks they are the same but the fish doesn't understand what it means to come from dirt like me.",
			"b": "I was pummeled and buffeted by the mysterious blank eyed cat before the house was over taken by flames.",
			"c": "To reach the party I walked for years across desert, grass and mud.  I took up residence in the bodies of decaying animals that never made it to survive the cold nights and devastating days." },
		"reward": {
			"a": "When I die and the sun bakes away my flesh my skull will point in the direction of the void.",
			"b": "If I die alone, unburied, I will fulfill the prophesy made by my parents in their home of garbage.",
			"c": "Is there a more noble quest than to just hang out and forget what has come before and ignore what will come after?" },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "ac", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "ac", "obstacle": "bc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "bc", "reward": "abc" }
	}
}