{
	"order": [ "origin", "origin", "goal", "goal", "obstacle", "obstacle", "reward", "reward" ],
	"cat": {
		"origin": {
			"a": "I was born like really far away, like the distance between our emotions.",
			"b": "My home was the meeting point of many aimless winds.",
			"c": "Where I grew up nothing happened so we only dreamed of parties." },
		"goal": {
			"a": "The party was so fun.  I liked the television.",
			"b": "It feels like a loneliness contest.",
			"c": "Is this mirror world everyone talks about like chill?" },
		"obstacle": {
			"a": "I heard that the smell is really fowl, worse than the farting trees in the east.",
			"b": "I always get in trouble for talking to someone and not someone else.",
			"c": "If we were friends for one thousandth of one second or a thousand years, what's the difference?" },
		"reward": {
			"a": "If I have to look for something, I guess I'd like to find myself.",
			"b": "The pig says it leads to a land under idtio like the veins under our skin.",
			"c": "I don't think its a joke when the birds say the meaning of our life is in our bowels." },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ab" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"pig": {
		"origin": {
			"a": "My home is a neglected desert where the earth is dry and the sea is acidic.",
			"b": "As an child I swam in the yellow waters of the south, dreaming to swim around to the north. I don't know if it works like that.",
			"c": "I was the biggest pig in my mother's long litter." },
		"goal": {
			"a": "I have suffered long searching for beauty and like beautiful thinking.",
			"b": "I sometimes lay restless at night wondering what the cat and television in hushed tones discuss.",
			"c": "I like listening as much as I like telling my story." },
		"obstacle": {
			"a": "What I'd like to find more than the void is true love.  Is it real?",
			"b": "Why no one remembers me, I've spent days mystified and in tears.",
			"c": "Like love, I believe the void is a myth, reeking of falsehood." },
		"reward": {
			"a": "I would only go into the void if it would reveal the nature of the cat.",
			"b": "Since the party I haven't spoken to the fruit or any creature without eyes ears.",
			"c": "Can we find love without first knowing isolation?" },
		"cat": { "origin": "abc", "goal": "c", "obstacle": "abc",  "reward": "bc" },
		"birds": { "origin": "abc", "goal": "c", "obstacle": "ab",  "reward": "c" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"birds": {
		"origin": {
			"a": "I grew up in the dense forest in the east.",
			"b": "I'm from the east, where trees begin and the desert ends.",
			"c": "I was happy living in the forest among the birds, I felt like I belonged." },
		"goal": {
			"a": "I left the forest following a beautiful and filthy creature across the rock path and into the hills.",
			"b": "I heard myths of an emotion called love in the whirring sounds of bugs.",
			"c": "One day I will build a nest." },
		"obstacle": {
			"a": "Do you know what love is?  Is it like the illuminating sunrise?  Is like the endless ocean?",
			"b": "We were two boats at sea going toward each other before the cat just fell asleep and drifted away.",
			"c": "I could fly across the sea but something in my bowels, some unnamed feeling,  holds me back." },
		"reward": {
			"a": "The void sounds like a lonely place to me.",
			"b": "What if I get to the void and there's no one else there?",
			"c": "In the forest they say the void is just a story that denies love, refuses discovery, rejects reciprocity." },
		"cat": { "origin": "abc", "goal": "ab", "obstacle": "ab", "reward": "ac" },
		"pig": { "origin": "abc", "goal": "bc", "obstacle": "ab", "reward": "c" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "ab" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"fruit": {
		"origin": {
			"a": "I was born in the south in the shadow of idtio's oldest tree.",
			"b": "In that curve of land the young become old.",
			"c": "My smelly home reeks of age and decay." },
		"goal": {
			"a": "The party just felt like a thousand eyes covering any place where a creature might move.",
			"b": "The cat waits. Some find it mysterious.  Some creatures don't care.",
			"c": "The pigwaved at me, like making nautical signs from a distant vessel, but like literally from ten feet away." },
		"obstacle": {
			"a": "I feel I would be fine like not knowing where everyone is from and where they're going.",
			"b": "I know we have to talk because there's nothing else to do but we could talk about the waves in the ocean, or the colors in the sunset or even the breeze that scatters leaves around the trees instead of some stupid smelly void the doesn't even exist.",
			"c": "Sorry I didn't see you waving." },
		"reward": {
			"a": "If the void is real the pig will find it and I'd rather continue wandering the desert than be stuck in made up mythical mirror world with that pig.",
			"b": "I'll wait here. I'll see you later.",
			"c": "It's a lie made up by a devious creature, and it's what I will believe even if it's not true." },
		"cat": { "origin": "abc", "goal": "ac", "obstacle": "abc", "reward": "ab" },
		"pig": { "origin": "abc", "goal": "ab", "obstacle": "abc", "reward": "bc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"worm": {
		"origin": {
			"a": "I was born probably in some dark dirt.",
			"b": "I emerged from dirt and then blinded by the endless sun.",
			"c": "I studied for years under the wisest worms to escape the endless dirt." },
		"goal": {
			"a": "I used my darkest inked pen to capture the end of the party.",
			"b": "Through my lifetime of squalor I learned to appreciate the beauty of limbful creatures.",
			"c": "My art is like a history, my drawings a recording." },
		"obstacle": {
			"a": "I see them look down at me and I see them thinking, 'You're a worm.'",
			"b": "I can see it in the eyes of my beloved, 'You're disgusting.'",
			"c": "My insides are seen through my translucent skin, they stare for nauseating entertainment." },
		"reward": {
			"a": "I will enter the world below the surface, I will dig through graves and unearth secrets.",
			"b": "I've seen death, and I've drawn it.",
			"c": "In the void I will paint that beautiful fruit." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "ab" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"tv": {
		"origin": {
			"a": "I never left the house, until it burned down.",
			"b": "I don't know where everyone went after the party ended.",
			"c": "I guess I'm not from anywhere." },
		"goal": {
			"a": "Not long ago I was a source of light in darkness, where creatures gathered together.",
			"b": "Everyone is searching for this mythic void but my burned down house is a void.",
			"c": "I feel lonely outside in the changeless air." },
		"obstacle": {
			"a": "I didn't know the pig was so obsessed.  I should have paid more attention.",
			"b": "I'm really waiting for everyone to give up searching for the endless darkness.",
			"c": "The screams of creatures as the flames found their way upstairs echo in my  head like bats in a cave." },
		"reward": {
			"a": "I want to be with the birds and their beautiful song, I could listen forever.",
			"b": "I want to be with the worm and watch the ink spread across each pleasing portrait.",
			"c": "I want to chill with the cat, the chillest creature who ever chilled." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ab" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "bc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "bc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "ac" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"cactus": {
		"origin": {
			"a": "I'm from the deserted lands beyond the house and two hills.",
			"b": "I was a child poet, author of an endless verse, about the endlessness of the desert.",
			"c": "The endless heat of the son was my parent and the endless darkness of night was my other parent." },
		"goal": {
			"a": "I described the heat, the sun, the cold, the moon.",
			"b": "I will write a new verse in the inverted void.",
			"c": "In the myth there is a true void hidden in the shadows, while false voids pierce the appendages of our land." },
		"obstacle": {
			"a": "My poem is about everything that has ever been imagined, every creature who has ever lived, every possibility that could be introduced in the inverted world.",
			"b": "No creature could compare to my endless companion, my endless poem.",
			"c": "It's true that no one understands the point of writing a poem." },
		"reward": {
			"a": "Of the birds I would write a verse of aloofity, about waiting behind a wall of quiescence, waiting for any other creature to cross that turbulent river of desolation.",
			"b": "Of the pig a bombastic ballad, a rueful lyric, a stupid haiku, on a pig eating poop.",
			"c": "Of the cat a quatrain of sadness, subtract one line for the words never spoken, and another for the looks unreturned, so a couplet like the couplets refused with creatures far and wide and especially, fantasticly far." },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "bc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"fish": {
		"origin": {
			"a": "I spawned in the North Sea ten years before the ten year party.",
			"b": "For years the other fish told me that no one would come to the sea so reluctantly I made my way to the land.",
			"c": "In childhood I was too busy swimming for my life to make friends." },
		"goal": {
			"a": "I only really hate one creature, a vile, slimy, legless worm.",
			"b": "I know that my time with the television was the most comfortable for me but I also know the television will never be happy with just the fish.",
			"c": "I don't want to talk about the party.  I'm over it.  We live in a vast land of mystery and sadness and that party ended ten years ago." },
		"obstacle": {
			"a": "My heart is pulled between sorrow and joy like the waves push and pull and break on the land.",
			"b": "Even if I wanted to I couldn't stop caring about the feelings of every creature.",
			"c": "If I wondered should I have ever left the sea wouldn't be able to go on." },
		"reward": {
			"a": "If they find death before the void these creatures will continue to wallow in their stupid sorrow, but they don't know death and the void are one and the same.",
			"b": "The land is so dry.  The sun is so hot.  Why doesn't anyone love me?",
			"c": "I know I can't find love in the sea. But where is the love on land?" },
		"cat": { "origin": "abc", "goal": "ab", "obstacle": "abc", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "bc", "obstacle": "abc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "ac", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"bug": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" }
	},
	"bug": {
		"origin": {
			"a": "I think I grew up in a pile of garbage for a while, I don't know where it was.  My parents didn't really talk about our family history.",
			"b": "I don't really remember anything that happened before yesterday, or today.",
			"c": "I remember the hunger of childhood like the hunger I feel now.  Have you eaten?" },
		"goal": {
			"a": "I've lived through worse than the party fire, and I keep on living for whatever reason.",
			"b": "Like the worm I've lived in dirt and worse, but I didn't become an annoying turd.",
			"c": "My memories rot like garbage in the sun, if I found the void I wouldn't even remember if I was in the void or outside of it." },
		"obstacle": {
			"a": "The legless fish sees the legless worm and thinks they are the same but the fish doesn't understand what it means to come from dirt like me.",
			"b": "I was pummeled and buffeted by the mysterious blank eyed cat before the house was over taken by flames.",
			"c": "To reach the party I walked for years across desert, grass and mud.  I took up residence in the bodies of decaying animals that never made it to survive the cold nights and devastating days." },
		"reward": {
			"a": "When I die and the sun bakes away my flesh my skull will point in the direction of the void.",
			"b": "If I die alone, unburied, I will fulfill the prophesy made by my parents in their home of garbage.",
			"c": "Is there a more noble quest than to just hang out and forget what has come before and ignore what will come after?" },
		"cat": { "origin": "abc", "goal": "abc", "obstacle": "ac", "reward": "abc" },
		"pig": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"birds": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fruit": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"worm": { "origin": "abc", "goal": "ac", "obstacle": "bc", "reward": "abc" },
		"tv": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"cactus": { "origin": "abc", "goal": "abc", "obstacle": "abc", "reward": "abc" },
		"fish": { "origin": "abc", "goal": "abc", "obstacle": "bc", "reward": "abc" }
	}
}